Apply Funtion

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#First we have to CREATE one python funtion because we use the code later

In [ ]:
def salary_hike(x):
    if x>3000:
        return np.ceil(x+(x*.30))
    else:
        return np.ceil(x*1.5)

In [ ]:
#Lets Create a Data Frame

In [ ]:
df=pd.DataFrame({'Dept':[1,2,3,4,5,6,7,8,9,10],
                'Emp_Name':['Rajesh','Shankar','Vihaan','Saurav','Gaurav','Riya','Munmun','Rohit','Yashu','Garima'],
                'Salary':[4994,5455,6166,4044,3433,2922,6466,7877,6766,5155]})

In [ ]:
df

In [ ]:
#Lets add nwe column name in old dataframe

In [ ]:
df['New Salary']=df['Salary'].apply(salary_hike)

In [ ]:
df

In [ ]:
#lets add new column . Length of name

In [ ]:
df['Name_Length']=df['Emp_Name'].apply(len)

In [ ]:
df

In [ ]:
#Lets know about how to use lambda function in our DataFrmae

In [ ]:
=df['New Salary'].apply(lambda x:np.sqrt(x))

In [ ]:
df['sqrt']=df['New Salary'].apply(lambda x:np.sqrt(x))

In [ ]:
df

In [ ]:
#Print Minimum and Maximum of the column 'New_Salary' are:

In [ ]:
print("Min and Max of the column 'New Salary' are  : ",df['New Salary'].min()    ,  df['New Salary'].max())

In [ ]:
#Deletion ,Sorting ,List of Column and Rows Names

In [ ]:
print("\n Name of Column \n",'-'*20,sep="")
print(df.columns)

In [ ]:
#If we want to print the column name in List format.

In [ ]:
l=list(df.columns)
print("\n Column name in a list of String for later manipulation : ",l)

In [ ]:
#Deleting Column name from Data Frame

In [ ]:
print("\n Deleting Column by 'del' command \n",'-'*50,sep=' ')
del df['Salary']
print(df)

In [ ]:
df

In [ ]:
#Lets Create a new data frame for use  isnull(). function

In [4]:
import pandas as pd
import numpy as np

In [5]:
df=pd.DataFrame({'Name':['Ramesh','Raghav',np.nan,np.nan],
                'Gender':[np.nan,'M','M','F'],
                'Section':['A','B','C','D'],
                'Class':[5,12,np.nan,np.nan],
                'Phone_Number':[np.nan,9406289124,8349089124,np.nan],
                'Location':['Bengluru','Noida','Hyderabad',np.nan],
                'Email_Present':['Y','N',np.nan,np.nan],
                'Door_Number':[np.nan,444,555,345],
                'Street_Name':['ABC','DEF','GHI','XYZ'],
                'Pin_Code':[5,12,np.nan,np.nan],
                 'State':[np.nan,'Up','Telangana',np.nan],
                 'Dad_Name':['XYZ','DEF','GHI',np.nan]},dtype=int)

df

C:\Users\safar\AppData\Local\Temp\ipykernel_12708\3431375823.py:1: FutureWarning: Could not cast to int32, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame({'Name':['Ramesh','Raghav',np.nan,np.nan],

,Name,Gender,Section,Class,Phone_Number,Location,Email_Present,Door_Number,Street_Name,Pin_Code,State,Dad_Name
0,Ramesh,NaN,A,5,NaN,Bengluru,Y,NaN,ABC,5,NaN,XYZ
1,Raghav,M,B,12,9406289124,Noida,N,444,DEF,12,Up,DEF
2,NaN,M,C,NaN,8349089124,Hyderabad,NaN,555,GHI,NaN,Telangana,GHI
3,NaN,F,D,NaN,NaN,NaN,NaN,345,XYZ,NaN,NaN,NaN

In [6]:
len(df.columns)

12

In [ ]:
len(df.columns)

In [ ]:
#Use isnull Function

In [7]:
df.isnull().sum()

Name             2
Gender           1
Section          0
Class            2
Phone_Number     2
Location         1
Email_Present    2
Door_Number      1
Street_Name      0
Pin_Code         2
State            2
Dad_Name         1
dtype: int64

In [8]:
df.isnull().sum().sum()

16

In [ ]:
#Lets Start Using CSV File in Pandad

In [ ]:
import pandas as pd

In [ ]:
#How to import CSV File in Pandas

In [ ]:
ipl=pd.read_csv('matches.csv')

In [ ]:
ipl

In [ ]:
#If Your Want to see top 5   rows

In [ ]:
ipl.head()

In [ ]:
#If you want to see last 5 rows

In [ ]:
ipl.tail()

In [ ]:
#If You want to see any column Randomly

In [ ]:
ipl.sample(n=5)  #N is v=containing how much row you want

# Importing File Direct From Github

-> Open any File in the github
-> click on 'Raw' ('This will open the file in raw format)
-> copy the link and paste as below

In [ ]:
ipl=pd.read_csv("https://raw.githubusercontent.com/s4sauravv/Datasets/main/matches.csv")

In [ ]:
ipl

In [ ]:
ipl.head()

In [ ]:
ipl.tail()

In [ ]:
#If you want to  know what is the shape of our DataFrame

In [ ]:
ipl.shape

In [ ]:
#Check Type OF Ipl

In [ ]:
type(ipl)

In [ ]:
ipl

In [ ]:
# If You Want to print all the rows you need to set as below and display the dataset

In [ ]:
pd.set_option('display.max_rows',None)

# Importing data from other Folder in your system
# -> Read Excel Files

In [ ]:
#Name of Sheet to read from

In [ ]:
excel_file=pd.read_excel(r"C:\Users\safar\Downloads\matches (1).csv")

In [ ]:
excel_file

In [ ]:
del ipl['id']

In [ ]:
ipl

# Exporting Data

In [ ]:
#Export to current Folder

In [ ]:
ipl.to_csv('ipl_copy1.csv')

In [ ]:
#Export to different folder bu giving - Means which folder i want to save the copy ipl file

In [ ]:
ipl.to_csv(r"D:\CSV Files.csv",header=True,index=False)

# Work with Real Time Example

https://www.basketball-reference.com/leagues/NBA_2015_totals.html

In [9]:
#when we have to use url to load dataframe from site

url='https://www.basketball-reference.com/leagues/NBA_2015_totals.html'

In [10]:
BB_data=pd.read_html(url)

In [11]:
BB_data

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

In [12]:
BB_data[0].head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

In [13]:
BB_data[0].tail()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [14]:
BB_data[0].sample(n=4) #we want 4 random rows

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
276,212,Roy Hibbert,C,28,IND,76,76,1926,317,710,...,.824,156,384,540,84,18,125,107,216,802
394,310,JaVale McGee,C,27,TOT,23,0,256,42,79,...,.667,18,43,61,3,2,20,18,30,106
153,118,Ed Davis,PF,25,LAL,79,24,1840,282,469,...,.487,230,370,600,94,49,98,58,202,656
213,163,Danilo Gallinari,SF,26,DEN,59,27,1426,228,568,...,.895,31,187,218,83,47,20,57,94,734

In [15]:
BB_data[0].shape#we checking shapes

(675, 30)

In [16]:
BB_data[0].columns#we checking columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [17]:
BB_data[0][['Rk','Player','Pos']].head() # when we dont want all columns then we use this method

  Rk         Player Pos
0  1     Quincy Acy  PF
1  2   Jordan Adams  SG
2  3   Steven Adams   C
3  4    Jeff Adrien  PF
4  5  Arron Afflalo  SG

In [18]:
BB_data[0]

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

If You want to print all the rows ,you need to set as below and display the dataset

In [ ]:
pd.set_option('display.max_rows',None)

In [ ]:
# Any Number of rows ,you want by writing as below

In [ ]:
pd.options.display.max_rows=4

# Data Time Manipulation

In [19]:
import numpy as np

In [20]:
import pandas as pd

In [32]:
date_range=pd.date_range('4/12/2021',periods=12)
dates=pd.DataFrame(date_range,columns=['Date'])

In [33]:
dates

         Date
0  2021-04-12
1  2021-04-13
2  2021-04-14
3  2021-04-15
4  2021-04-16
5  2021-04-17
6  2021-04-18
7  2021-04-19
8  2021-04-20
9  2021-04-21
10 2021-04-22
11 2021-04-23

In [35]:
dates['Day']=dates['Date'].dt.day
dates['Month']=dates['Date'].dt.month
dates['Year']=dates['Date'].dt.year

In [36]:
dates

         Date  Day  Month  Year
0  2021-04-12   12      4  2021
1  2021-04-13   13      4  2021
2  2021-04-14   14      4  2021
3  2021-04-15   15      4  2021
4  2021-04-16   16      4  2021
5  2021-04-17   17      4  2021
6  2021-04-18   18      4  2021
7  2021-04-19   19      4  2021
8  2021-04-20   20      4  2021
9  2021-04-21   21      4  2021
10 2021-04-22   22      4  2021
11 2021-04-23   23      4  2021

In [37]:
{'Date_Time':['Jan 1 12:00 AM','Jan 2 12:00 AM']}

{'Date_Time': ['Jan 1 12:00 AM', 'Jan 2 12:00 AM']}

Example to convert object date into proper date format

In [38]:
df=pd.DataFrame({'Date_Time':['Jan 1 12:00 AM','Jan 2 12:00 AM']})

In [39]:
df

        Date_Time
0  Jan 1 12:00 AM
1  Jan 2 12:00 AM

In [40]:
type(df)

pandas.core.frame.DataFrame

# Visit https://docs.python.org/3/library/datetime.html

In [41]:
df['Date']=pd.to_datetime(df['Date_Time'],format='%b %d %I:%M %p')

In [42]:
df

        Date_Time       Date
0  Jan 1 12:00 AM 1900-01-01
1  Jan 2 12:00 AM 1900-01-02

In [43]:
df['Day']=df['Date'].dt.day

In [44]:
df['Month']=df['Date'].dt.month
df['Year']=df['Date'].dt.year
print(df)

        Date_Time       Date  Day  Month  Year
0  Jan 1 12:00 AM 1900-01-01    1      1  1900
1  Jan 2 12:00 AM 1900-01-02    2      1  1900

In [45]:
#Might You have question why its show year as 1990.. because If there is not available year then the default year is 1900